cf/InformationRegisters/ВнешнееОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВнешнееОборудование</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВнешнееОборудование</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/НастройкиМашины.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НастройкиМашины</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УстановленОпенОфис</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановленВорд</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяКомпьютера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/CommonModules/ВнешнееОборудованиеСервер/Ext/Module.bsl
Функция ПолучитьСписокУстановленногоОборудования(ИмяКомпьютера) Экспорт
	
	// Возвращает соответствие
	// в которой в ключе перечисление оборудования (перечисление.)
	// в значении настройки
	
	Оборудование = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Оборудование, Настройки ИЗ РегистрСведений.ВнешнееОборудование ГДЕ ИмяКомпьютера = """ + ИмяКомпьютера + """");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Настройки = ЗначениеИзСтрокиВнутр(Выборка.Настройки);
		Оборудование.Вставить(Выборка.Оборудование, ?(ПустаяСтрока(Настройки),Новый Структура, Настройки));
		
	КонецЦикла;
	
	Возврат Оборудование;
	
КонецФункции

Функция ПолучитьНастройкиОборудования(Оборудование, ИмяКомпьютера) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ Оборудование, Настройки ИЗ РегистрСведений.ВнешнееОборудование ГДЕ Оборудование = &Оборудование И ИмяКомпьютера = """ + ИмяКомпьютера + """");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат ЗначениеИзСтрокиВнутр(Выборка.Настройки);
		
	КонецЕсли;

КонецФункции

Функция ПолучитьНастройкиМашины(ИмяКомпьютера) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.НастройкиМашины ГДЕ ИмяКомпьютера ПОДОБНО """ + ИмяКомпьютера + """");
	Возврат КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
КонецФункции
